IdeaRS.OpenModel.Concrete.InputValue
Input value type

IdeaRS.OpenModel.Concrete.InputValue.Calculated
Value is calculated

IdeaRS.OpenModel.Concrete.InputValue.UserInput
Value is inputed by user

IdeaRS.OpenModel.Concrete.InputValue.CalculatedFEM
values are calculated in FEM